{
  "fixVersion": "hyrax 1.15.0",
  "newFeatures": [
    {
      "title": "CoverageJSON",
      "body": "For datasets that contain geo-spatial data, we now provide the option to get those data (and related metadata) encoded using the [covjson](https://covjson.org/) format. Thanks to Corey Hemphill, Riley Rimer, and Lewis McGibbney for this contribution."
    },
    {
      "title": "JSON-LD",
      "body": "With this release Hyrax adds JSON-LD content to every browser navigable catalog page ( i.e. \"*/contents.html\") and to every dataset/granule OPeNDAP Data Access Form. This feature along with the site map generation can be used to assist search engines like Google to catalog/index/find the data you wish the world to access."
    },
    {
      "title": "New Data Access Form",
      "body": "In addition to utilizing the mod_auth_urs Apache module to provide Earthdata Login services Hyrax now has it's own standalone implementation of the Earthdata Login client. This means that it can be deployed using only Tomcat (or other servlet Engine) and still work with Earthdata Login with out binding it to an instance of Apache httpd"
    },
    {
      "title": "MetaData Store (MDS)",
      "body": "A new cache has been added to the BES for Metadata Responses (aka, the MDS or MetaData Store). This cache is unlike the other BES caches in that it is intended to be operated as either a 'cache' or a 'store.' In the latter case, items added will never be removed - it is an open-ended place where metadata response objects will be kept indefinitely. The MDS contents (as a cache or a store) will persist through Hyrax restarts."
    },
    {
      "title": "Prototype support for data stored on Amazon's S3 Web Object Store",
      "body": "Hyrax 1.15 has prototype support for subset-in-place of HDF5 and NetCDF4 data files that are stored on AWS S3. Data files stored in S3 must be configured for use with this feature of Hyrax. To configure files for us with this feature, a special metadata file must be built and installed in the MDS. For this feature, the MDS should be run in 'store' mode. Note: The software has a known problem with requests for very large numbers of variables in a single URL. Contact us for details. We welcome feedback on this new feature."
    },
    {
      "title": "Improved catalog support",
      "body": "We have generalized the Hyrax catalog system so that it is much easier to extend. As an example, we have implemented a new module that reads information about datasets from NASA's Common Metadata Repository (CMR) and uses that to display virtual directories for NASA data holdings. This software is currently available in source form only - contact us if you would like to extend the Hyrax Catalog system for your own data collections."
    },
    {
      "title": "Aggregation service web API",
      "body": "Hyrax 1.15 has support for a web API that provides a way for users to apply an operation on a group of data files or data sets. The results can be packages in netcdf3 or 4 files, as ASCII data or in tables as CSV data. The service can form a complex kind of user-specified aggregation. See the [aggregation service documentation](https://docs.opendap.org/index.php?title=Aggregation_enhancements) for more information."
    },
    {
      "title": "Additional support for CF for HDF4 Files",
      "body": "CF option - Enhance the support of handling the scale_factor and add_offset to follow the CF. The scale_factor and\nadd_offset rule for the MOD16A3 product is different than other MODIS products. We make an exception for\nthis product only to ensure the scale_factor and add_offset follow the CF conventions.\n\nFor other the new features and fixes see [What’s new for Hyrax 1.15.0](https://github.com/OPENDAP/hdf4_handler/blob/master/README) in the HDF4 handler README files. \n"
    },
    {
      "title": "Additional support for CF for HDF5 Files",
      "body": "CF option -\n\n1. Added support of the HDF-EOS5 Polar Stereographic(PS) and Lambert Azimuthal Equal Area(LAMAZ) grid projection files. Both projection files can be found in NASA LANCE products.\n1. Added HDF-EOS5 grid latitude and longitude cache support. This is the same as what we did for the HDF-EOS2 grid.\n1. Added support for TROP-OMI, new OMI level 2 and OMPS-NPP product.\n1. Removed the internal reserved netCDF-4 attributes for DAP output.\n 1. Made the behavior of the \"drop long string\" BES key consistent with the current limitation of netCDF Java.\n\nFor other the new features and fixes see [What’s new for Hyrax 1.15.0](https://github.com/OPENDAP/hdf4_handler/blob/master/README) in the HDF4 handler README files. "
    }
  ],
  "bugFixes": [
    {
      "key": "HYRAX-10",
      "summary": "The fileout netCDF-4 doesn't generate the correct dimensions for aggregated files"
    },
    {
      "key": "HYRAX-247",
      "summary": "<Dimension> elements in a constrained DMR sometimes have 'random' order"
    },
    {
      "key": "HYRAX-248",
      "summary": "fileout_gdal seems to build broken JP2k files"
    },
    {
      "key": "HYRAX-362",
      "summary": "Make the GeoTiff (GDAL) handler work with NCML aggregations"
    },
    {
      "key": "HYRAX-554",
      "summary": "BES now includes DMR++; hack the configure script WRT libcurl"
    },
    {
      "key": "HYRAX-561",
      "summary": "The fileout_netcdf, and/or the ncml_handler code does not clean up the temporary netCDF result file if the requesting client is killed during the transaction."
    },
    {
      "key": "HYRAX-588",
      "summary": "Gateway HTML Form Rendering Failure"
    },
    {
      "key": "HYRAX-591",
      "summary": "Tests that create files fail 'make distcheck' (e.g., the tests for HYRAX-561)"
    },
    {
      "key": "HYRAX-595",
      "summary": "The \"SHOW HELP\" button in the DAP2 Data Request Form points to a broken link"
    },
    {
      "key": "HYRAX-598",
      "summary": "NULL pointer dereference in D4ParserSax2"
    },
    {
      "key": "HYRAX-599",
      "summary": "Symbolic links to data not showing up in Hyrax 1.14.0 RPMs on CentOS 7"
    },
    {
      "key": "HYRAX-630",
      "summary": "The Keywords feature of libdap is hosed"
    },
    {
      "key": "HYRAX-600",
      "summary": "Unable to startup Hyrax installed from RPM on boot on Centos OS 7"
    },
    {
      "key": "HYRAX-603",
      "summary": "The OLFS authentication code is no longer compatible with the current deployment \"bootstrap\"."
    },
    {
      "key": "HYRAX-612",
      "summary": "Renaming the result of an aggregation (only join new?) fails."
    },
    {
      "key": "HYRAX-613",
      "summary": "OLFS installation bootstrap is broken on CentOS-7"
    },
    {
      "key": "HYRAX-621",
      "summary": "Replace logo.gif with a transparent logo.png in Hyrax"
    },
    {
      "key": "HYRAX-623",
      "summary": "Fix the CI build"
    },
    {
      "key": "HYRAX-645",
      "summary": "Build issue causes make -j check to fail"
    },
    {
      "key": "HYRAX-851",
      "summary": "Memory leak in BESCatalog"
    },
    {
      "key": "HYRAX-845",
      "summary": "BESUtil::get_time() has a pointer problem"
    },
    {
      "key": "HYRAX-844",
      "summary": "THREDDS catalog produced by Hyrax no longer work with Unidata code because of time zone issues"
    },
    {
      "key": "HYRAX-837",
      "summary": "libdap seems to return DAP2 and DAP3.2 DDX responses in kind of random way."
    },
    {
      "key": "HYRAX-833",
      "summary": "Update baselines for BES cmdlm tests"
    },
    {
      "key": "HYRAX-646",
      "summary": "Target collect-coverage-data doesn't work"
    },
    {
      "key": "HYRAX-670",
      "summary": "Reading values from olfs.xml file is fragile"
    },
    {
      "key": "HYRAX-818",
      "summary": "showNode removes catalog name from the path name of the node - stop it."
    },
    {
      "key": "HYRAX-805",
      "summary": "fileout_netcdf memory errors"
    },
    {
      "key": "HYRAX-804",
      "summary": "Error in ResponseBuilderTest - a unit test"
    },
    {
      "key": "HYRAX-803",
      "summary": "NcML Memory errors"
    },
    {
      "key": "HYRAX-802",
      "summary": "Issues remain in the Aggregation rename bug"
    },
    {
      "key": "HYRAX-801",
      "summary": "ASAN Reveals 104 issues in the BES"
    },
    {
      "key": "HYRAX-647",
      "summary": "The DDS print_das() method does not produce the same DAS as the DAS::print() method for Grids sometimes"
    },
    {
      "key": "HYRAX-648",
      "summary": "MDS tests 61 and 62 fail on the first run of ./testsuite --conf=bes.mds.conf"
    },
    {
      "key": "HYRAX-692",
      "summary": "cppunit-config is no longer present in cppunit"
    },
    {
      "key": "HYRAX-794",
      "summary": "Some tests regarding the enum type in the netcdf handler  fail randomly"
    },
    {
      "key": "HYRAX-791",
      "summary": "w10n syntax collides with URI encoding rules enforced by recent Tomcat"
    },
    {
      "key": "HYRAX-790",
      "summary": "geogrid is failing in OLFS regression tests"
    },
    {
      "key": "HYRAX-775",
      "summary": "The DMR response from the MDS has the xml:base attribute in a random place."
    },
    {
      "key": "HYRAX-767",
      "summary": "Change the Data Request Form code (all 3 versions) so that it URL encodes the query before using it."
    },
    {
      "key": "HYRAX-764",
      "summary": "Fileout_netcdf returns empty response for dataset when no query is provided."
    },
    {
      "key": "HYRAX-756",
      "summary": "get_dmrpp fails on datasets where variables are not in the root group"
    },
    {
      "key": "HYRAX-721",
      "summary": "The implementation of Sequence in the XSLT based Data Request Form (IFH) is broken"
    },
    {
      "key": "HYRAX-723",
      "summary": "The DMR++ parser doesn't see a newline (cr?) as whitepspace."
    },
    {
      "key": "HYRAX-723",
      "summary": "Broker service needs to make correct links for data access."
    },
    {
      "key": "HYRAX-755",
      "summary": "The build_dmrpp code seems to fail on DMRs/Files with several variables."
    }
  ]
}